perf/load-test.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 20
      name: "Ramp up to normal load"
    - duration: 300
      arrivalRate: 20
      name: "Sustain normal load"

scenarios:
  - name: "Exchange operations (USD to ARS)"
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 1
            baseAccountId: 11
            counterAccountId: 10