perf/recovery-test.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 100
      name: "Ramp up to normal load"
    - duration: 60
      arrivalRate: 100
      rampTo: 600
      name: "Ramp up to max load"
    - duration: 10
      arrivalRate: 600
      name: "Sustain max load"
    - duration: 120
      arrivalRate: 600
      rampTo: 100
      name: "Ramp down to normal load"
    - duration: 30
      arrivalRate: 100
      name: "Sustain normal load"

scenarios:
  - name: "Exchange operations (USD to ARS)"
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 1
            baseAccountId: 11
            counterAccountId: 10