perf/spike-test.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  phases:
    - duration: 60
      arrivalRate: 20
      name: "Base load"
    - duration: 60
      arrivalRate: 200
      # arrivalRate: 300
      name: "Spike"
    - duration: 60
      arrivalRate: 20
      name: "Recovery"

scenarios:
  - name: "Spike test"
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 1
            baseAccountId: 11
            counterAccountId: 10